src/test/projects/depgraph-maven-plugin-test/expectations/graph_module-2.mmd
flowchart TD
  %% Node Definitions:
  com.github.ferstl:module-2:jar["module-2"]
  com.github.ferstl:module-1:jar["module-1"]
  com.google.guava:guava:jar["guava"]
  commons-codec:commons-codec:jar["commons-codec"]
  org.apache.commons:commons-lang3:jar["commons-lang3"]
  org.springframework:spring-core:jar["<font size=1>#lt;optional#gt;</font><br/>spring-core"]
  junit:junit:jar["junit<br/><font size=1>(test)</font>"]
  org.hamcrest:hamcrest-core:jar["hamcrest-core<br/><font size=1>(test)</font>"]

  %% Edge Definitions:
  com.github.ferstl:module-2:jar --> com.github.ferstl:module-1:jar
  com.github.ferstl:module-2:jar --> com.google.guava:guava:jar
  com.github.ferstl:module-2:jar --> commons-codec:commons-codec:jar
  com.github.ferstl:module-2:jar --> org.apache.commons:commons-lang3:jar
  com.github.ferstl:module-2:jar --> org.springframework:spring-core:jar
  junit:junit:jar --> org.hamcrest:hamcrest-core:jar
  com.github.ferstl:module-2:jar --> junit:junit:jar
